app/Models/BlogModel.php

SELECT *
FROM `blogs`
WHERE `status` = 'Active'
 LIMIT 4
---
	public function getblogs($limit = null)
	{


		$builder = $this->db->table('blogs');
		$builder = $builder->select('*')
			->where('status =', 'Active');
			 if ($limit) {
        $builder->limit($limit); // ✅ limit lagti hai query run hone se pehle
    }
			   $query = $builder->get();