app/Models/CategoryModel.php

	public function getCategory($limit = null)
	{
		$builder = $this->db->table('categories');
		$builder = $builder->select('*')
			->where('status =', 'Active');
			 if ($limit) {
        $builder->limit($limit); // ✅ limit lagti hai query run hone se pehle
    }
			   $query = $builder->get();
---
SELECT *
FROM `categories`
WHERE `status` = 'Active'
 LIMIT 3