app/Models/DownloadModel.php

INSERT INTO `downloads` (`ppt_id`, `created_at`) VALUES ('45', '2025-09-26 06:24:28')
---
   public function addDownload( $pptId)
    {
        $builder = $this->db->table('downloads');
        return $builder->insert([

            'ppt_id'     => $pptId,
            'created_at' => date('Y-m-d H:i:s')
        ]);

SELECT `ppt_id`, COUNT(id) as no_of_downloads
FROM `downloads`
GROUP BY `ppt_id`
---
    public function countDownloadsById()
    {
        $builder = $this->db->table('downloads');
        $builder->select('ppt_id, COUNT(id) as no_of_downloads');
       $builder->groupBy('ppt_id');
        return $builder->get()->getResultArray();