app/Models/LikeModel.php

     public function countLikesById()
    {
        $builder = $this->db->table('likes');
        $builder->select('type_id, COUNT(id) as no_of_likes');
       $builder->groupBy('type_id');


        return $builder->get()->getResultArray();
---
SELECT `type_id`, COUNT(id) as no_of_likes
FROM `likes`
GROUP BY `type_id`