app/Models/PptModel.php

SELECT *
FROM `ppts`
WHERE `status` = 'Active'
 LIMIT 3
---
	public function getppts($limit = null)
	{


		$builder = $this->db->table('ppts');
		$builder = $builder->select('*')
			->where('status =', 'Active');
			 if ($limit) {
        $builder->limit($limit); //
    }
			   $query = $builder->get();