app/Models/RatingModel.php

     public function countRatingsById()
    {
        $builder = $this->db->table('ratings');
        $builder->select('video_id, COUNT(id) as no_of_ratings');
       $builder->groupBy('video_id');
        return $builder->get()->getResultArray();
---
SELECT `video_id`, COUNT(id) as no_of_ratings
FROM `ratings`
GROUP BY `video_id`