app/Models/ThumbnailModel.php

	public function getthumbnails($limit = null)
	{


		$builder = $this->db->table('videothumbnails');
		$builder = $builder->select('*')
			->where('status =', 'Active');
			 if ($limit) {
        $builder->limit($limit); // ✅ limit lagti hai query run hone se pehle
    }
			   $query = $builder->get();
---
SELECT *
FROM `videothumbnails`
WHERE `status` = 'Active'
 LIMIT 3