app/Models/VisitorModel.php

SELECT `counts`
FROM `visitor_counter`
WHERE `id` = 1
UPDATE `visitor_counter` SET `counts` = 708
WHERE `id` = 1
---
    public function increaseCount()
    {
        $builder = $this->db->table('visitor_counter');


        $builder->select('counts');
        $builder->where('id', 1);
        $query = $builder->get();
        $row   = $query->getRowArray();

        if ($row) {
            $newCount = (int) $row['counts'] + 1;


            $builder = $this->db->table('visitor_counter');
            $builder->where('id', 1);
            $builder->update(['counts' => $newCount]);